heyting/heyting.org
#+TITLE: argumentation structures as heyting algebras
#+DATE: october 31, 2018
#+AUTHOR: kuan yu
#+EMAIL: kuanyu@uni-postdam.de

* an argumentation as

** a category

an argumentation structure can be described by a heyting algebra.
we can start with the structure of a category.[fn:1]
it consists of
- a collection of objects \(p, q, r, \ldots\) which are sentences;
- a collection of morphisms which describes the supporting relation;
there is an arrow \(f : p \to q\) when \(p\) supports \(q\), such that
- arrows can be composed:
  whenever there are \(f : p \to q\) and \(g : q \to r\),
  there is \(h = g \circ f : p \to r\);
  namely that the supporting relation is transitive;
- composition is associative: \((h \circ g) \circ f = h \circ (g \circ f)\);
  namely that the supports can be given in any order;
- for every object \(q\), there is an identity arrow \(id_{q} : q \to q\)
  satisfying the unit laws \(id_{q} \circ f = f\) and \(g \circ id_{q} = g\);
  namely that every sentence supports itself.

** a preorder

on top of that, it has the structure of a preorder.[fn:2]
- there is at most one arrow from one object to another,
  namely that \(p\) either supports \(q\) or it does not.
we can alter this perspective if we wish,
but it is convenient.

** a lattice

furthermore, it has the structure of a lattice.[fn:3]
- for every two objects \(p\) and \(q\),
  there are objects \(p \times q\) and \(p + q\),
  which are their product and coproduct.
  namely that we can always consider the conjunction and disjunction of two sentences;
- there is an initial object \(0\) with an arrow to every other object;
  it represents nonsense since it supports everything;
- there is a terminal object \(1\) with an arrow from every other object;
  it represents sensibility since we wish to make sense of all sentences.
binary products with the terminal object gives us all finite product.
the terminal object is in fact the nullary product,
being the identity under product.
"we must consider p and common sense" is just saying "we must consider p".
likewise, the initial object is the nullary coproduct,
being the identity under coproduct.
"we must consider p or we might as well [something ridiculous]" is just saying "we must consider p".

** a heyting algebra

finally, we arrive at the structure of a heyting algebra.[fn:4]
- for every two object \(p\) and \(q\),
  there is an exponential object \(p \to q\), also written as \(q^{p}\),
  representing the potential supporting connection,
  which may not hold, but we can always consider it.

** summary

in summary, a heyting algebra is a bicartesian closed preorder.
"bicartesian" refers to finite products and coproducts,
and "closed" refers to exponentials.

* examples

we will consider the scheme by Peldszus and Stede (2013).[fn:5]
and discuss how these structures can be expressed with the language defined above.

** support

| support          | \(p\) supports \(q\)                      | \(p \to q\)                    |
| serial support   | \(p\) supports \(q\) which supports \(r\) | \((p \to q) \times (q \to r)\) |
| linked support   | \(p\) supports \(r\) since \(q\)          | \((p \times q) \to r\)         |
| multiple support | both \(p\) and \(q\) supports \(r\)       | \((p + q) \to r\)              |

by the universal property of these constructions
- multiple support \((p + q) \to r\) is equivalent to \((p \to r) \times (q \to r)\),
  namely that they can be given in isolation;
- linked support \((p \times q) \to r\) is equivalent to \(q \to (p \to r)\) as well as \(p \to (q \to r)\),
  namely that \(q\) can be considered a warrent for \(p \to r\),
  and \(p\) a warrent for \(q \to r\).

** attack

- \(r\) rebuts \(q\) can be expressed as \(r \to (q \to 0)\),
  namely that \(r\) suggests that \(q\) is nonsensical;
  the expression is equivalent to \((q \times r) \to 0\),
  "you think \(q\) but consider \(r\), it is ridiculous";
- \(r\) undercuts the argument that \(p\) supports \(q\) can be expressed as \(r \to ((p \to q) \to 0)\),
  which is a case of rebuttal where \(q\) is replace with \(p \to q\),
  namely a higher-order rebuttal;
- the other types of attacks can be obtained by recursion, including counter-attacks;
  for example rebutting a rebutter \((r \to (q \to 0)) \times (s \to (r \to 0))\)
  "you think \(q\) is unreasonable because \(r\), but in fact \(r\) is unreasonable because \(s\)".

* validating argumentation structures

argumentation structures can be validated by the semantics of corresponding heyting algebras.

