heyting/heyting.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-11-01 Thu 05:29 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>argumentation structures as heyting algebras</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="kuan yu" />
</head>
<body>
<div id="content">
<h1 class="title">argumentation structures as heyting algebras</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgaa33faf">1. an argumentation as</a>
<ul>
<li><a href="#orge59fc8b">1.1. a category</a></li>
<li><a href="#org2b37d0b">1.2. a preorder</a></li>
<li><a href="#orge9c0c86">1.3. a lattice</a></li>
<li><a href="#orgc4af216">1.4. a heyting algebra</a></li>
<li><a href="#orgb3fc351">1.5. summary</a></li>
</ul>
</li>
<li><a href="#org9847566">2. examples</a>
<ul>
<li><a href="#orgd043fa9">2.1. support</a></li>
<li><a href="#org5bd84d6">2.2. attack</a></li>
</ul>
</li>
<li><a href="#org2baa15c">3. validating argumentation structures</a>
<ul>
<li><a href="#org4598f4c">3.1. evaluation</a></li>
<li><a href="#org9166638">3.2. examples</a>
<ul>
<li><a href="#orgbec2074">3.2.1. support</a></li>
<li><a href="#orgb052222">3.2.2. serial support</a></li>
<li><a href="#orga625f78">3.2.3. linked support</a></li>
<li><a href="#org7e34358">3.2.4. multiple support</a></li>
<li><a href="#orged2e335">3.2.5. counter</a></li>
<li><a href="#orgbfa8fa6">3.2.6. undercut</a></li>
<li><a href="#org09bfe2b">3.2.7. support and counter</a></li>
<li><a href="#org143b8b7">3.2.8. rebut rebutter</a></li>
<li><a href="#orgead9929">3.2.9. support and rebut rebutter</a></li>
<li><a href="#org44d8cff">3.2.10. support and undercut rebutter</a></li>
<li><a href="#orge5ae194">3.2.11. undercut rebutter</a></li>
<li><a href="#org6eb3f7c">3.2.12. higher-order support</a></li>
<li><a href="#org40532f1">3.2.13. conjunctive support</a></li>
<li><a href="#org43c2fed">3.2.14. disjunctive support</a></li>
<li><a href="#org4e50081">3.2.15. higher-order claim</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org48bf2b7">4. ramblings</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgaa33faf" class="outline-2">
<h2 id="orgaa33faf"><span class="section-number-2">1</span> an argumentation as</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orge59fc8b" class="outline-3">
<h3 id="orge59fc8b"><span class="section-number-3">1.1</span> a category</h3>
<div class="outline-text-3" id="text-1-1">
<p>
an argumentation structure can be described by a heyting algebra.
we can start with the structure of a category.<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup>
it consists of
</p>
<ul class="org-ul">
<li>a collection of objects \(p, q, r, \ldots\) which are sentences;</li>
<li>a collection of morphisms which describes the supporting relation;</li>
</ul>
<p>
there is an arrow \(f : p \to q\) when \(p\) supports \(q\), such that
</p>
<ul class="org-ul">
<li>arrows can be composed:
whenever there are \(f : p \to q\) and \(g : q \to r\),
there is \(h = g \circ f : p \to r\);
namely that the supporting relation is transitive;</li>
<li>composition is associative: \((h \circ g) \circ f = h \circ (g \circ f)\);
namely that the supports can be given in any order;</li>
<li>for every object \(q\), there is an identity arrow \(id_{q} : q \to q\)
satisfying the unit laws \(id_{q} \circ f = f\) and \(g \circ id_{q} = g\);
namely that every sentence supports itself.</li>
</ul>
</div>
</div>

<div id="outline-container-org2b37d0b" class="outline-3">
<h3 id="org2b37d0b"><span class="section-number-3">1.2</span> a preorder</h3>
<div class="outline-text-3" id="text-1-2">
<p>
on top of that, it has the structure of a preorder.<sup><a id="fnr.2" class="footref" href="#fn.2">2</a></sup>
</p>
<ul class="org-ul">
<li>there is at most one arrow from one object to another,
namely that \(p\) either supports \(q\) or it does not.</li>
</ul>
<p>
we can alter this perspective if we wish,
but it is convenient.
</p>
</div>
</div>

<div id="outline-container-orge9c0c86" class="outline-3">
<h3 id="orge9c0c86"><span class="section-number-3">1.3</span> a lattice</h3>
<div class="outline-text-3" id="text-1-3">
<p>
furthermore, it has the structure of a lattice.<sup><a id="fnr.3" class="footref" href="#fn.3">3</a></sup>
</p>
<ul class="org-ul">
<li>for every two objects \(p\) and \(q\),
there are objects \(p \times q\) and \(p + q\),
which are their product and coproduct.
namely that we can always consider the conjunction and disjunction of two sentences;</li>
<li>there is an initial object \(0\) with an arrow to every other object;
it represents nonsense since it supports everything;</li>
<li>there is a terminal object \(1\) with an arrow from every other object;
it represents sensibility since we wish to make sense of all sentences.</li>
</ul>
<p>
binary products with the terminal object gives us all finite product.
the terminal object is in fact the nullary product,
being the identity under product.
"we must consider p and common sense" is just saying "we must consider p".
likewise, the initial object is the nullary coproduct,
being the identity under coproduct.
"we must consider p or we might as well [something ridiculous]" is just saying "we must consider p".
</p>
</div>
</div>

<div id="outline-container-orgc4af216" class="outline-3">
<h3 id="orgc4af216"><span class="section-number-3">1.4</span> a heyting algebra</h3>
<div class="outline-text-3" id="text-1-4">
<p>
finally, we arrive at the structure of a heyting algebra.<sup><a id="fnr.4" class="footref" href="#fn.4">4</a></sup>
</p>
<ul class="org-ul">
<li>for every two object \(p\) and \(q\),
there is an exponential object \(p \to q\), also written as \(q^{p}\),
representing the potential supporting connection,
which may not hold, but we can always consider it.</li>
</ul>
</div>
</div>

<div id="outline-container-orgb3fc351" class="outline-3">
<h3 id="orgb3fc351"><span class="section-number-3">1.5</span> summary</h3>
<div class="outline-text-3" id="text-1-5">
<p>
in summary, a heyting algebra is a bicartesian closed preorder.
"bicartesian" refers to finite products and coproducts,
and "closed" refers to exponentials.
</p>
</div>
</div>
</div>

<div id="outline-container-org9847566" class="outline-2">
<h2 id="org9847566"><span class="section-number-2">2</span> examples</h2>
<div class="outline-text-2" id="text-2">
<p>
we will consider the scheme by Peldszus and Stede (2013).<sup><a id="fnr.5" class="footref" href="#fn.5">5</a></sup>
and discuss how these structures can be expressed with the language defined above.
</p>
</div>

<div id="outline-container-orgd043fa9" class="outline-3">
<h3 id="orgd043fa9"><span class="section-number-3">2.1</span> support</h3>
<div class="outline-text-3" id="text-2-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">support</td>
<td class="org-left">\(p\) supports \(q\)</td>
<td class="org-left">\(p \to q\)</td>
</tr>

<tr>
<td class="org-left">serial support</td>
<td class="org-left">\(p\) supports \(q\) which supports \(r\)</td>
<td class="org-left">\((p \to q) \times (q \to r)\)</td>
</tr>

<tr>
<td class="org-left">linked support</td>
<td class="org-left">\(p\) supports \(r\) since \(q\)</td>
<td class="org-left">\((p \times q) \to r\)</td>
</tr>

<tr>
<td class="org-left">multiple support</td>
<td class="org-left">both \(p\) and \(q\) supports \(r\)</td>
<td class="org-left">\((p + q) \to r\)</td>
</tr>
</tbody>
</table>

<p>
by the universal property of these constructions
</p>
<ul class="org-ul">
<li>multiple support \((p + q) \to r\) is equivalent to \((p \to r) \times (q \to r)\),
namely that they can be given in isolation;</li>
<li>linked support \((p \times q) \to r\) is equivalent to \(q \to (p \to r)\) as well as \(p \to (q \to r)\),
namely that \(q\) can be considered a warrent for \(p \to r\),
and \(p\) a warrent for \(q \to r\).</li>
</ul>
</div>
</div>

<div id="outline-container-org5bd84d6" class="outline-3">
<h3 id="org5bd84d6"><span class="section-number-3">2.2</span> attack</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>\(r\) rebuts \(q\) can be expressed as \(r \to (q \to 0)\),
namely that \(r\) suggests that \(q\) is nonsensical;
the expression is equivalent to \((q \times r) \to 0\),
"you think \(q\) but consider \(r\), it is ridiculous";</li>
<li>\(r\) undercuts the argument that \(p\) supports \(q\) can be expressed as \(r \to ((p \to q) \to 0)\),
which is a case of rebuttal where \(q\) is replace with \(p \to q\),
namely a higher-order rebuttal;</li>
<li>the other types of attacks can be obtained by recursion, including counter-attacks;
for example rebutting a rebutter \((r \to (q \to 0)) \times (s \to (r \to 0))\)
"you think \(q\) is unreasonable because \(r\), but in fact \(r\) is unreasonable because \(s\)".</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org2baa15c" class="outline-2">
<h2 id="org2baa15c"><span class="section-number-2">3</span> validating argumentation structures</h2>
<div class="outline-text-2" id="text-3">
<p>
argumentation structures can be validated by the semantics of corresponding heyting algebras.
</p>
</div>
