heyting/heyting.org
** evaluation

the =check= function takes an expression and constructs the truth-table for semantic evaluation.

#+BEGIN_SRC clojure :eval no
(defn check [expr env]
  (cond (find env expr) (list env)
        (symbol? expr)  (list (assoc env expr true) (assoc env expr false))
        :else (let [[x op y] expr]
                (for [env (check x env)
                      env (check y env)]
                  (assoc env expr
                         (condp = op
                           '-> (or (not (env x)) (env y))
                           '* (and (env x) (env y))
                           '+ (or (env x) (env y))))))))
#+END_SRC

using peirce's law as an example.

#+BEGIN_SRC clojure :eval no
(check '(((p -> q) -> p) -> p) {})
=>
({p true,  q true,  (p -> q) true,  ((p -> q) -> p) true,  (((p -> q) -> p) -> p) true}
 {p true,  q false, (p -> q) false, ((p -> q) -> p) true,  (((p -> q) -> p) -> p) true}
 {p false, q true,  (p -> q) true,  ((p -> q) -> p) false, (((p -> q) -> p) -> p) true}
 {p false, q false, (p -> q) true,  ((p -> q) -> p) false, (((p -> q) -> p) -> p) true})
#+END_SRC

the checking mechanism is primitive.
implication is defined in terms of disjunction and negation,
which means that the logic it admits is non-constructive.
it is in fact a checker for boolean algebra,
and not heyting algebra.
but it works fine in most cases.

#+BEGIN_SRC clojure :eval no
(defn lift [x] (fn [f] (f x)))

(defn valid? [expr claim facts]
  (as-> facts $
    (zipmap $ (repeat true))
    (assoc $ 0 false 1 true)
    (check expr $)
    (filter (lift expr) $)
    (mapcat (partial check claim) $)
    (some->> $ seq (every? (lift claim)))))

(defmacro valid! [expr claim facts]
  `(valid? '~expr '~claim '~facts))
#+END_SRC

the macro =valid!= is defined for the convenience of validating an argumentation structure.
it takes an expression, the central claim, and collection of propositions which are taken as facts.
in an argumentation graph, the central claim is the root node, and the facts are the leaf nodes.

** examples

*** support

"\(p\) supports \(q\)."

#+BEGIN_SRC clojure :eval no
(valid! (p > q) q [p])
=> true
#+END_SRC

the claim \(q\) is valid when \(p\) is taken as fact,

*** serial support

"\(p\) supports \(q\), and \(q\) supports \(r\)."

#+BEGIN_SRC clojure :eval no
(valid! ((p -> q) * (q -> r)) r [p])
=> true
#+END_SRC

only \(p\) is the leaf node for the claim \(r\).

*** linked support

"\(p\) and \(q\) together supports \(r\)."

#+BEGIN_SRC clojure :eval no
(valid! ((p * q) -> r) r [p])
=> false

(valid! ((p * q) -> r) r [p q])
=> true
#+END_SRC

both \(p\) and \(q\) must be taken as facts
for the claim \(r\) to hold.

*** multiple support

"both \(p\) and \(q\) supports \(r\)."

#+BEGIN_SRC clojure :eval no
(valid! ((p + q) -> r) r [p q])
=> true

(valid! ((p + q) -> r) r [p])
=> true

(valid! ((p + q) -> r) r [q])
=> true
#+END_SRC

then either \(p\) or \(q\) is sufficient.

*** counter

"\(q\) is bad, since \(r\)."

#+BEGIN_SRC clojure :eval no
(valid! (r -> (q -> 0)) q [r])
=> false
#+END_SRC

there is nothing to support the claim \(q\).

*** undercut

"\(p\) does not support \(q\), since \(r\)."

#+BEGIN_SRC clojure :eval no
(valid! (r -> ((p -> q) -> 0)) q [r p])
=> false
#+END_SRC

same as above.

*** support and counter

"\(q\) is good because \(p\), and it is bad because \(r\), therefore \(q\)."

#+BEGIN_SRC clojure :eval no
(valid! ((p -> q) * (r -> (q -> 0))) q [p r])
=> nil
#+END_SRC

this would be an odd argumentation.
it in fact holds logically, due to the principle of explosion.
when contradictory premises are given, any claim would hold.
however the implementation of the =valid?= function returns =nil=
instead of =true= or =false= when there is no situation where the premises stand.

*** rebut rebutter

"\(q\) would be bad if \(r\), but \(r\) is wrong because \(s\)."

#+BEGIN_SRC clojure :eval no
(valid! ((r -> (q -> 0)) * (s -> (r -> 0))) q [s])
=> false
#+END_SRC

the attacker got attacked but there is still nothing to support the claim.

*** support and rebut rebutter

"\(q\) is good because \(p\).
it would be bad if \(r\), but \(r\) is wrong because \(s\)."

#+BEGIN_SRC clojure :eval no
(valid! ((p -> q) * ((r -> (q -> 0)) * (s -> (r -> 0)))) q [p s])
=> true
#+END_SRC

when we add the support \(p\), the claim \(q\) becomes valid.

*** support and undercut rebutter

"\(q\) is good because \(p\).
some say it is bad because \(r\), but not necessarily because \(s\)."

#+BEGIN_SRC clojure :eval no
(valid! ((p -> q) * (s -> ((r -> (q -> 0)) -> 0))) q [p r s])
=> true
#+END_SRC

same as above.

