heyting/heyting.html

<div id="outline-container-org4598f4c" class="outline-3">
<h3 id="org4598f4c"><span class="section-number-3">3.1</span> evaluation</h3>
<div class="outline-text-3" id="text-3-1">
<p>
the <code>check</code> function takes an expression and constructs the truth-table for semantic evaluation.
</p>

<div class="org-src-container">
<pre class="src src-clojure">(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">check</span> [expr env]
  (<span style="color: #a020f0;">cond</span> (find env expr) (list env)
        (symbol? expr)  (list (assoc env expr <span style="color: #008b8b;">true</span>) (assoc env expr <span style="color: #008b8b;">false</span>))
        <span style="color: #008b8b;">:else</span> (<span style="color: #a020f0;">let</span> [[x op y] expr]
                (<span style="color: #a020f0;">for</span> [env (check x env)
                      env (check y env)]
                  (assoc env expr
                         (<span style="color: #a020f0;">condp</span> = op
                           '-&gt; (<span style="color: #a020f0;">or</span> (not (env x)) (env y))
                           '* (<span style="color: #a020f0;">and</span> (env x) (env y))
                           '+ (<span style="color: #a020f0;">or</span> (env x) (env y))))))))
</pre>
</div>

<p>
using peirce's law as an example.
</p>

<div class="org-src-container">
<pre class="src src-clojure">(check '(((p -&gt; q) -&gt; p) -&gt; p) {})
=&gt;
({p <span style="color: #008b8b;">true</span>,  q <span style="color: #008b8b;">true</span>,  (p -&gt; q) <span style="color: #008b8b;">true</span>,  ((p -&gt; q) -&gt; p) <span style="color: #008b8b;">true</span>,  (((p -&gt; q) -&gt; p) -&gt; p) <span style="color: #008b8b;">true</span>}
 {p <span style="color: #008b8b;">true</span>,  q <span style="color: #008b8b;">false</span>, (p -&gt; q) <span style="color: #008b8b;">false</span>, ((p -&gt; q) -&gt; p) <span style="color: #008b8b;">true</span>,  (((p -&gt; q) -&gt; p) -&gt; p) <span style="color: #008b8b;">true</span>}
 {p <span style="color: #008b8b;">false</span>, q <span style="color: #008b8b;">true</span>,  (p -&gt; q) <span style="color: #008b8b;">true</span>,  ((p -&gt; q) -&gt; p) <span style="color: #008b8b;">false</span>, (((p -&gt; q) -&gt; p) -&gt; p) <span style="color: #008b8b;">true</span>}
 {p <span style="color: #008b8b;">false</span>, q <span style="color: #008b8b;">false</span>, (p -&gt; q) <span style="color: #008b8b;">true</span>,  ((p -&gt; q) -&gt; p) <span style="color: #008b8b;">false</span>, (((p -&gt; q) -&gt; p) -&gt; p) <span style="color: #008b8b;">true</span>})
</pre>
</div>

<p>
the checking mechanism is primitive.
implication is defined in terms of disjunction and negation,
which means that the logic it admits is non-constructive.
it is in fact a checker for boolean algebra,
and not heyting algebra.
but it works fine in most cases.
</p>

<div class="org-src-container">
<pre class="src src-clojure">(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">lift</span> [x] (<span style="color: #a020f0;">fn</span> [f] (f x)))

(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">valid?</span> [expr claim facts]
  (<span style="color: #a020f0;">as-&gt;</span> facts $
    (zipmap $ (repeat <span style="color: #008b8b;">true</span>))
    (assoc $ 0 <span style="color: #008b8b;">false</span> 1 <span style="color: #008b8b;">true</span>)
    (check expr $)
    (filter (lift expr) $)
    (mapcat (partial check claim) $)
    (some-&gt;&gt; $ seq (every? (lift claim)))))

(<span style="color: #a020f0;">defmacro</span> <span style="color: #0000ff;">valid!</span> [expr claim facts]
  `(valid? '~expr '~claim '~facts))
</pre>
</div>

<p>
the macro <code>valid!</code> is defined for the convenience of validating an argumentation structure.
it takes an expression, the central claim, and collection of propositions which are taken as facts.
in an argumentation graph, the central claim is the root node, and the facts are the leaf nodes.
</p>
</div>
</div>

<div id="outline-container-org9166638" class="outline-3">
<h3 id="org9166638"><span class="section-number-3">3.2</span> examples</h3>
<div class="outline-text-3" id="text-3-2">
</div>
<div id="outline-container-orgbec2074" class="outline-4">
<h4 id="orgbec2074"><span class="section-number-4">3.2.1</span> support</h4>
<div class="outline-text-4" id="text-3-2-1">
<p>
"\(p\) supports \(q\)."
</p>

<div class="org-src-container">
<pre class="src src-clojure">(valid! (p &gt; q) q [p])
=&gt; <span style="color: #008b8b;">true</span>
</pre>
</div>

<p>
the claim \(q\) is valid when \(p\) is taken as fact,
</p>
</div>
</div>

<div id="outline-container-orgb052222" class="outline-4">
<h4 id="orgb052222"><span class="section-number-4">3.2.2</span> serial support</h4>
<div class="outline-text-4" id="text-3-2-2">
<p>
"\(p\) supports \(q\), and \(q\) supports \(r\)."
</p>

<div class="org-src-container">
<pre class="src src-clojure">(valid! ((p -&gt; q) * (q -&gt; r)) r [p])
=&gt; <span style="color: #008b8b;">true</span>
</pre>
</div>

<p>
only \(p\) is the leaf node for the claim \(r\).
</p>
</div>
</div>

<div id="outline-container-orga625f78" class="outline-4">
<h4 id="orga625f78"><span class="section-number-4">3.2.3</span> linked support</h4>
<div class="outline-text-4" id="text-3-2-3">
<p>
"\(p\) and \(q\) together supports \(r\)."
</p>

<div class="org-src-container">
<pre class="src src-clojure">(valid! ((p * q) -&gt; r) r [p])
=&gt; <span style="color: #008b8b;">false</span>

(valid! ((p * q) -&gt; r) r [p q])
=&gt; <span style="color: #008b8b;">true</span>
</pre>
</div>

<p>
both \(p\) and \(q\) must be taken as facts
for the claim \(r\) to hold.
</p>
</div>
</div>

<div id="outline-container-org7e34358" class="outline-4">
<h4 id="org7e34358"><span class="section-number-4">3.2.4</span> multiple support</h4>
<div class="outline-text-4" id="text-3-2-4">
<p>
"both \(p\) and \(q\) supports \(r\)."
</p>

<div class="org-src-container">
<pre class="src src-clojure">(valid! ((p + q) -&gt; r) r [p q])
=&gt; <span style="color: #008b8b;">true</span>

(valid! ((p + q) -&gt; r) r [p])
=&gt; <span style="color: #008b8b;">true</span>

(valid! ((p + q) -&gt; r) r [q])
=&gt; <span style="color: #008b8b;">true</span>
</pre>
</div>

<p>
then either \(p\) or \(q\) is sufficient.
</p>
</div>
</div>

<div id="outline-container-orged2e335" class="outline-4">
<h4 id="orged2e335"><span class="section-number-4">3.2.5</span> counter</h4>
<div class="outline-text-4" id="text-3-2-5">
<p>
"\(q\) is bad, since \(r\)."
</p>

<div class="org-src-container">
<pre class="src src-clojure">(valid! (r -&gt; (q -&gt; 0)) q [r])
=&gt; <span style="color: #008b8b;">false</span>
</pre>
</div>

<p>
there is nothing to support the claim \(q\).
</p>
</div>
</div>

<div id="outline-container-orgbfa8fa6" class="outline-4">
<h4 id="orgbfa8fa6"><span class="section-number-4">3.2.6</span> undercut</h4>
<div class="outline-text-4" id="text-3-2-6">
<p>
"\(p\) does not support \(q\), since \(r\)."
</p>

<div class="org-src-container">
<pre class="src src-clojure">(valid! (r -&gt; ((p -&gt; q) -&gt; 0)) q [r p])
=&gt; <span style="color: #008b8b;">false</span>
</pre>
</div>

<p>
same as above.
</p>
</div>
</div>

<div id="outline-container-org09bfe2b" class="outline-4">
<h4 id="org09bfe2b"><span class="section-number-4">3.2.7</span> support and counter</h4>
<div class="outline-text-4" id="text-3-2-7">
<p>
"\(q\) is good because \(p\), and it is bad because \(r\), therefore \(q\)."
</p>

<div class="org-src-container">
<pre class="src src-clojure">(valid! ((p -&gt; q) * (r -&gt; (q -&gt; 0))) q [p r])
=&gt; <span style="color: #008b8b;">nil</span>
</pre>
</div>

<p>
this would be an odd argumentation.
it in fact holds logically, due to the principle of explosion.
when contradictory premises are given, any claim would hold.
however the implementation of the <code>valid?</code> function returns <code>nil</code>
instead of <code>true</code> or <code>false</code> when there is no situation where the premises stand.
</p>
</div>
</div>

<div id="outline-container-org143b8b7" class="outline-4">
<h4 id="org143b8b7"><span class="section-number-4">3.2.8</span> rebut rebutter</h4>
<div class="outline-text-4" id="text-3-2-8">
<p>
"\(q\) would be bad if \(r\), but \(r\) is wrong because \(s\)."
</p>

<div class="org-src-container">
<pre class="src src-clojure">(valid! ((r -&gt; (q -&gt; 0)) * (s -&gt; (r -&gt; 0))) q [s])
=&gt; <span style="color: #008b8b;">false</span>
</pre>
</div>

<p>
the attacker got attacked but there is still nothing to support the claim.
</p>
</div>
</div>

<div id="outline-container-orgead9929" class="outline-4">
<h4 id="orgead9929"><span class="section-number-4">3.2.9</span> support and rebut rebutter</h4>
<div class="outline-text-4" id="text-3-2-9">
<p>
"\(q\) is good because \(p\).
it would be bad if \(r\), but \(r\) is wrong because \(s\)."
</p>

<div class="org-src-container">
<pre class="src src-clojure">(valid! ((p -&gt; q) * ((r -&gt; (q -&gt; 0)) * (s -&gt; (r -&gt; 0)))) q [p s])
=&gt; <span style="color: #008b8b;">true</span>
</pre>
</div>

<p>
when we add the support \(p\), the claim \(q\) becomes valid.
</p>
</div>
</div>

<div id="outline-container-org44d8cff" class="outline-4">
<h4 id="org44d8cff"><span class="section-number-4">3.2.10</span> support and undercut rebutter</h4>
<div class="outline-text-4" id="text-3-2-10">
<p>
"\(q\) is good because \(p\).
some say it is bad because \(r\), but not necessarily because \(s\)."
</p>

<div class="org-src-container">
<pre class="src src-clojure">(valid! ((p -&gt; q) * (s -&gt; ((r -&gt; (q -&gt; 0)) -&gt; 0))) q [p r s])
=&gt; <span style="color: #008b8b;">true</span>
</pre>
</div>

<p>
same as above.
</p>
</div>
</div>
