heyting/heyting.org
*** undercut rebutter

"some say \(q\) is bad because \(r\), but not necessarily because \(s\)."

#+BEGIN_SRC clojure :eval no
(valid! (s -> ((r -> (q -> 0)) -> 0)) q [r s])
=> true
#+END_SRC

this is a very odd case.
the claim \(q\) holds due to the non-constructive nature of the logic checker:
- \(s\) true (given as fact)
- \((r \to (q \to 0)) \to 0\) true (by the undercut)
- \(r \to (q \to 0)\) false (by negation)
- \(q \to 0\) false (since \(r\) given)
- \(q\) true (by the law of excluded middle)
in a constructive setting, the final derivation does not hold, which is more desirable,
since merely undercutting the rebutter is not supporting the claim.

*** higher-order support

"the argument that \(p\) supports \(q\), supports \(r\)."

#+BEGIN_SRC clojure :eval no
(valid! ((p -> q) -> r) r [p])
=> false

(valid! ((p -> q) -> r) r [(p -> q)])
=> true
#+END_SRC

the claim \(r\) does not hold when only \(p\) is taken as fact.
we need the exponential object \(p \to q\) as the leaf node.

*** conjunctive support

"\(p\) supports \(r\) and \(s\),
and both \(r\) and \(s\) supports \(q\)."

#+BEGIN_SRC clojure :eval no
(valid! ((p -> (r * s)) * ((r * s) -> q)) q [p])
=> true
#+END_SRC

the argumentation structure is no longer a tree but a graph.
we could however make copies of the leaf node \(p\) to maintain the tree structure.

*** disjunctive support

"\(p\) suggests either \(r\) or \(s\),
but in whichever case, \(q\)."

#+BEGIN_SRC clojure :eval no
(valid! ((p -> (r + s)) * ((r + s) -> q)) q [p])
=> true
#+END_SRC

"\(p\) suggests either \(r\) or \(s\),
but \(r\) cannot happen,
therefore \(q\)."

#+BEGIN_SRC clojure :eval no
(valid! ((p -> (q + r)) * (r -> 0)) q [p])
=> true
#+END_SRC

in the disjunctive case, the graph structure is difficult to eliminate.

*** higher-order claim

"\(q\) is reason for \(p\) because \(p\) makes \(q\) and we need \(q\)."

#+BEGIN_SRC clojure :eval no
(valid! (p -> q) (q -> p) [p])
=> true
#+END_SRC

aristotle's telos.
the claim itself is an exponential object.

* ramblings

we only need supporting arrows to describe argumentation structures.
attacking arrows can be derived with the help of the initial object.
but it is convenient to have two types of arrows,
and these two descriptions are interchangeable anyways.

we do need universal constructions (product, coproduct, exponential).
it would be difficult to describe some higher-order constructions without them.
although these constructions probably does not occur very often empirically.

support is not just binary.
if we wish to consider different types of supporting relations,
then we have to break the preorder structure.
instead of heyting algebras, we need bicartesian closed categories.[fn:6]
furthermore we may consider quantification of arguments,
and work in heyting categories aka logoi and locally catesian closed categories.[fn:7][fn:8]

we have seen the usage of universal constructions,
but what about functor and natural transformations and all the other stuff in category theory,
and how might they help with argumentation mining.

* Footnotes

[fn:1] https://ncatlab.org/nlab/show/category
[fn:2] https://ncatlab.org/nlab/show/preorder
[fn:3] https://ncatlab.org/nlab/show/lattice
[fn:4] https://ncatlab.org/nlab/show/Heyting+algebra
[fn:5] https://dl.acm.org/citation.cfm?id=2603498
[fn:6] https://ncatlab.org/nlab/show/bicartesian+closed+category
[fn:7] https://ncatlab.org/nlab/show/Heyting+category
[fn:8] https://ncatlab.org/nlab/show/locally+cartesian+closed+category
