heyting/heyting.html

<div id="outline-container-orge5ae194" class="outline-4">
<h4 id="orge5ae194"><span class="section-number-4">3.2.11</span> undercut rebutter</h4>
<div class="outline-text-4" id="text-3-2-11">
<p>
"some say \(q\) is bad because \(r\), but not necessarily because \(s\)."
</p>

<div class="org-src-container">
<pre class="src src-clojure">(valid! (s -&gt; ((r -&gt; (q -&gt; 0)) -&gt; 0)) q [r s])
=&gt; <span style="color: #008b8b;">true</span>
</pre>
</div>

<p>
this is a very odd case.
the claim \(q\) holds due to the non-constructive nature of the logic checker:
</p>
<ul class="org-ul">
<li>\(s\) true (given as fact)</li>
<li>\((r \to (q \to 0)) \to 0\) true (by the undercut)</li>
<li>\(r \to (q \to 0)\) false (by negation)</li>
<li>\(q \to 0\) false (since \(r\) given)</li>
<li>\(q\) true (by the law of excluded middle)</li>
</ul>
<p>
in a constructive setting, the final derivation does not hold, which is more desirable,
since merely undercutting the rebutter is not supporting the claim.
</p>
</div>
</div>

<div id="outline-container-org6eb3f7c" class="outline-4">
<h4 id="org6eb3f7c"><span class="section-number-4">3.2.12</span> higher-order support</h4>
<div class="outline-text-4" id="text-3-2-12">
<p>
"the argument that \(p\) supports \(q\), supports \(r\)."
</p>

<div class="org-src-container">
<pre class="src src-clojure">(valid! ((p -&gt; q) -&gt; r) r [p])
=&gt; <span style="color: #008b8b;">false</span>

(valid! ((p -&gt; q) -&gt; r) r [(p -&gt; q)])
=&gt; <span style="color: #008b8b;">true</span>
</pre>
</div>

<p>
the claim \(r\) does not hold when only \(p\) is taken as fact.
we need the exponential object \(p \to q\) as the leaf node.
</p>
</div>
</div>

<div id="outline-container-org40532f1" class="outline-4">
<h4 id="org40532f1"><span class="section-number-4">3.2.13</span> conjunctive support</h4>
<div class="outline-text-4" id="text-3-2-13">
<p>
"\(p\) supports \(r\) and \(s\),
and both \(r\) and \(s\) supports \(q\)."
</p>

<div class="org-src-container">
<pre class="src src-clojure">(valid! ((p -&gt; (r * s)) * ((r * s) -&gt; q)) q [p])
=&gt; <span style="color: #008b8b;">true</span>
</pre>
</div>

<p>
the argumentation structure is no longer a tree but a graph.
we could however make copies of the leaf node \(p\) to maintain the tree structure.
</p>
</div>
</div>

<div id="outline-container-org43c2fed" class="outline-4">
<h4 id="org43c2fed"><span class="section-number-4">3.2.14</span> disjunctive support</h4>
<div class="outline-text-4" id="text-3-2-14">
<p>
"\(p\) suggests either \(r\) or \(s\),
but in whichever case, \(q\)."
</p>

<div class="org-src-container">
<pre class="src src-clojure">(valid! ((p -&gt; (r + s)) * ((r + s) -&gt; q)) q [p])
=&gt; <span style="color: #008b8b;">true</span>
</pre>
</div>

<p>
"\(p\) suggests either \(r\) or \(s\),
but \(r\) cannot happen,
therefore \(q\)."
</p>

<div class="org-src-container">
<pre class="src src-clojure">(valid! ((p -&gt; (q + r)) * (r -&gt; 0)) q [p])
=&gt; <span style="color: #008b8b;">true</span>
</pre>
</div>

<p>
in the disjunctive case, the graph structure is difficult to eliminate.
</p>
</div>
</div>

<div id="outline-container-org4e50081" class="outline-4">
<h4 id="org4e50081"><span class="section-number-4">3.2.15</span> higher-order claim</h4>
<div class="outline-text-4" id="text-3-2-15">
<p>
"\(q\) is reason for \(p\) because \(p\) makes \(q\) and we need \(q\)."
</p>

<div class="org-src-container">
<pre class="src src-clojure">(valid! (p -&gt; q) (q -&gt; p) [p])
=&gt; <span style="color: #008b8b;">true</span>
</pre>
</div>

<p>
aristotle's telos.
the claim itself is an exponential object.
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-org48bf2b7" class="outline-2">
<h2 id="org48bf2b7"><span class="section-number-2">4</span> ramblings</h2>
<div class="outline-text-2" id="text-4">
<p>
we only need supporting arrows to describe argumentation structures.
attacking arrows can be derived with the help of the initial object.
but it is convenient to have two types of arrows,
and these two descriptions are interchangeable anyways.
</p>

<p>
we do need universal constructions (product, coproduct, exponential).
it would be difficult to describe some higher-order constructions without them.
although these constructions probably does not occur very often empirically.
</p>

<p>
support is not just binary.
if we wish to consider different types of supporting relations,
then we have to break the preorder structure.
instead of heyting algebras, we need heyting categories aka logoi.<sup><a id="fnr.6" class="footref" href="#fn.6">6</a></sup>
the terminal object does interesting things there.
</p>

<p>
we have seen the usage of universal constructions,
but what about functor and natural transformations and all the other stuff in category theory,
and how might they help with argumentation mining.
</p>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
<a href="https://ncatlab.org/nlab/show/category">https://ncatlab.org/nlab/show/category</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2">2</a></sup> <div class="footpara"><p class="footpara">
<a href="https://ncatlab.org/nlab/show/preorder">https://ncatlab.org/nlab/show/preorder</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.3" class="footnum" href="#fnr.3">3</a></sup> <div class="footpara"><p class="footpara">
<a href="https://ncatlab.org/nlab/show/lattice">https://ncatlab.org/nlab/show/lattice</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.4" class="footnum" href="#fnr.4">4</a></sup> <div class="footpara"><p class="footpara">
<a href="https://ncatlab.org/nlab/show/Heyting+algebra">https://ncatlab.org/nlab/show/Heyting+algebra</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.5" class="footnum" href="#fnr.5">5</a></sup> <div class="footpara"><p class="footpara">
<a href="https://dl.acm.org/citation.cfm?id=2603498">https://dl.acm.org/citation.cfm?id=2603498</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.6" class="footnum" href="#fnr.6">6</a></sup> <div class="footpara"><p class="footpara">
<a href="https://ncatlab.org/nlab/show/Heyting+category">https://ncatlab.org/nlab/show/Heyting+category</a>
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="date">Date: october 31, 2018</p>
<p class="author">Author: kuan yu</p>
<p class="date">Created: 2018-11-01 Thu 05:29</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
